import React from "react";

const Menu = () => {                                            // Створення функціонального компонента Menu
    const dishes = [                                            // Масив страв з їх назвами та цінами
        { name: "Рулет \"Шуба\"", price: 10 },
        { name: "Профітролі з креветкою і сьомгою", price: 8 },
        { name: "Рибне плато", price: 12 },
    ];                                                         // Масив страв з їх назвами та цінами
    return (                                                   // Повертає JSX
        <main>
            <h2>Menu</h2>
            <ul>
                {dishes.map((dish, index) => (                 // Перебір масиву страв
                    <li key={index}>                           {/*Створення списку <li>*/} 
                        {dish.name} - ₴{dish.price} грн.       {/*Виведення назви страви та її ціни*/}
                    </li>
                ))}
            </ul>
        </main>
    );
};                                                              // Створення функціонального компонента Menu

export default Menu;                                          // Експорт компонента Menu для використання в інших частинах програми